// #1
// დაწერეთ ფუნქცია რომელსაც გადასცემთ წინადადებას და ციფრს
// მაგალითად fn("გამარჯობა, როგორ ხარ?", 5)
// ფუნქციამ უნდა შეამოკლოს ხუთი სიმბოლო და დაამატოს ბოლოში "..."
// და დააბრუნოს შედეგი "გამარ..."

// function cutSentence(text, num){
//    if(num < text.length){
//        const SlicedText = text.slice(0,num)  + '...'
//        return SlicedText;
//    }
// }
// const text = "გამარჯობა, როგორ ხარ?" 
// const num = 5
// const result = cutSentence(text, num);
// console.log(result)
// cutSentence()

// #2
// დაწერეთ ფუნქცია რომელსაც გადასცემთ ციფრების მასივს
// ფუნქციამ უნდა დააბრუნოს მასივში მარტივი რიცხვების ჯამი
// მაგალითად fn([1, 2, 3, 4, 5, 6, 7, 8, 9, 10])
// მარტივი არის ციფრი რომელიც იყოფა მხოლოდ 1-ზე და თავის თავზე
 

//ეს ვცადე მაგრამ ვერდავწერე :D
// const arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

// function simpleNums (num){
//     arr.split
//     if(num % 1 === 0 && num % num === 0 ){
//     return
//     }
// }
// simpleNums()

// #3
// დაწერეთ ფუნქცია რომელსაც გადასცემთ ტელეფონის ნომერს
// და ქვეყანას
// მაგალითად fn("995599123456", "GE")
// თუ ქვეყანა არის GE დააბრუნოს +995599123456
// თუ ქვეყანა არის US დააბრუნოს +1(995)99123456
// თუ ქვეყანა არის RU დააბრუნოს +7(995)99123456
// თუ ქვეყანა არის სხვა დააბრუნოს შეცდომა "არ ვიცით რა ქვეყანაა ეს"

// function getNumber(countyCode){
//     if(countyCode==='GE'){
//         console.log("+995599123456")
//     } 
//     else if(countyCode==='US'){
//         console.log("+1(995)99123456")
//     }
//     else  if(countyCode === 'RU'){
//         console.log('+7(995)99123456')
//     }else{
//         console.log('არ ვიცით რა ქვეყანაა ეს')
//     }
// }

// getNumber("GE")


// #4
// დაწერეთ ფუნქცია რომელსაც გადასცემთ ციფრების მასივს
// მაგალითად fn([1, 2, 3, 3, 5, 2, 7, 8, 7, 10])
// დააბრუნოს მასივის ყველა უნიკალური ელემენტი
// მაგალითად [1, 2, 3, 5, 7, 8, 10]

// function uniqueElements (arr) {
//     return Array.from(new Set(arr))
// }
// const numbers = [1, 2, 3, 3, 5, 2, 7, 8, 7, 10]
// const uniqueNums = uniqueElements(numbers);
// console.log(uniqueNums);

// #5
// დაწერეთ ბანკომატის ფუნქციონალი რომელსაც გადასცემთ ციფრს
// ბანკომატში გვაქვს 200 , 100 , 50, 20, 10, 5 ლარიანი კუპიურები
// ფუნქციამ უნდა გვითხრას რამდენ ცალს და რამდენ ლარიან კუპიურად
// დაგვიშლის ჩვენს თანხას
// მაგალითად თუ ვეტყვით რომ გვინდა 555 ლარი
// ფუნქციამ უნდა დაგვიბრუნოს
// 2 ცალი 200 ლარიანი
// 1 ცალი 100 ლარიანი
// 1 ცალი 50 ლარიანი
// 1 ცალი 5 ლარიანი
